rorke-time/experiment1-sriov-rorke-time/rorke50-memtier-250k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=1250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        13903.35          ---          ---         1.21391         0.69500        14.20700        22.39900       935.41 
Gets       139002.01     54939.24     84062.76         1.19404         0.67900        14.01500        21.88700      6646.20 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     152905.36     54939.24     84062.76         1.19585         0.68700        14.01500        21.88700      7581.61 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.055        0.000
SET       0.303        5.000
SET       0.375       10.000
SET       0.431       15.000
SET       0.471       20.000
SET       0.511       25.000
SET       0.543       30.000
SET       0.567       35.000
SET       0.607       40.000
SET       0.647       45.000
SET       0.695       50.000
SET       0.727       52.500
SET       0.759       55.000
SET       0.799       57.500
SET       0.839       60.000
SET       0.887       62.500
SET       0.927       65.000
SET       0.975       67.500
SET       1.023       70.000
SET       1.079       72.500
SET       1.135       75.000
SET       1.175       76.250
SET       1.207       77.500
SET       1.255       78.750
SET       1.295       80.000
SET       1.351       81.250
SET       1.407       82.500
SET       1.471       83.750
SET       1.535       85.000
SET       1.615       86.250
SET       1.703       87.500
SET       1.751       88.125
SET       1.807       88.750
SET       1.863       89.375
SET       1.927       90.000
SET       1.983       90.625
SET       2.063       91.250
SET       2.143       91.875
SET       2.223       92.500
SET       2.319       93.125
SET       2.431       93.750
SET       2.495       94.062
SET       2.559       94.375
SET       2.639       94.688
SET       2.703       95.000
SET       2.799       95.312
SET       2.911       95.625
SET       3.039       95.938
SET       3.215       96.250
SET       3.423       96.562
SET       3.743       96.875
SET       3.983       97.031
SET       4.287       97.188
SET       4.671       97.344
SET       5.311       97.500
SET       6.623       97.656
SET       8.063       97.812
SET       9.215       97.969
SET      10.175       98.125
SET      10.943       98.281
SET      11.647       98.438
SET      11.967       98.516
SET      12.351       98.594
SET      12.671       98.672
SET      13.055       98.750
SET      13.439       98.828
SET      13.759       98.906
SET      14.143       98.984
SET      14.527       99.062
SET      14.911       99.141
SET      15.295       99.219
SET      15.487       99.258
SET      15.679       99.297
SET      15.935       99.336
SET      16.191       99.375
SET      16.511       99.414
SET      16.767       99.453
SET      17.023       99.492
SET      17.279       99.531
SET      17.663       99.570
SET      17.919       99.609
SET      18.175       99.629
SET      18.303       99.648
SET      18.431       99.668
SET      18.687       99.688
SET      18.943       99.707
SET      19.071       99.727
SET      19.327       99.746
SET      19.583       99.766
SET      19.839       99.785
SET      20.095       99.805
SET      20.223       99.814
SET      20.351       99.824
SET      20.479       99.834
SET      20.735       99.844
SET      20.863       99.854
SET      21.119       99.863
SET      21.503       99.873
SET      21.631       99.883
SET      22.015       99.893
SET      22.527       99.902
SET      22.655       99.907
SET      22.911       99.912
SET      23.167       99.917
SET      23.423       99.922
SET      23.679       99.927
SET      23.935       99.932
SET      24.063       99.937
SET      24.447       99.941
SET      24.703       99.946
SET      24.831       99.951
SET      25.087       99.954
SET      25.343       99.956
SET      25.471       99.958
SET      25.599       99.961
SET      25.855       99.963
SET      26.239       99.966
SET      26.367       99.968
SET      26.623       99.971
SET      27.007       99.973
SET      27.391       99.976
SET      27.775       99.977
SET      27.775       99.978
SET      28.031       99.979
SET      28.159       99.980
SET      28.543       99.982
SET      28.799       99.983
SET      29.055       99.984
SET      29.823       99.985
SET      30.719       99.987
SET      31.615       99.988
SET      31.743       99.988
SET      32.127       99.989
SET      32.511       99.990
SET      32.639       99.990
SET      32.767       99.991
SET      33.023       99.991
SET      33.023       99.992
SET      33.279       99.993
SET      33.791       99.993
SET      34.303       99.994
SET      34.559       99.994
SET      34.559       99.995
SET      34.815       99.995
SET      35.071       99.995
SET      35.583       99.995
SET      36.095       99.996
SET      36.095       99.996
SET      36.863       99.996
SET      36.863       99.997
SET      37.375       99.997
SET      37.375       99.997
SET      37.887       99.997
SET      38.399       99.997
SET      38.399       99.998
SET      38.399       99.998
SET      38.655       99.998
SET      38.655       99.998
SET      39.167       99.998
SET      39.167       99.998
SET      39.167       99.998
SET      39.167       99.999
SET      39.167       99.999
SET      39.167       99.999
[...]
SET      39.935       99.999
SET      39.935       99.999
SET      39.935       99.999
[...]
SET      40.447       99.999
SET      40.447       99.999
SET      40.447       99.999
[...]
SET      40.447      100.000
SET      40.959      100.000
SET      40.959      100.000
SET      40.959      100.000
[...]
SET      43.263      100.000
SET      43.263      100.000
---
GET       0.047        0.000
GET       0.287        5.000
GET       0.367       10.000
GET       0.423       15.000
GET       0.455       20.000
GET       0.495       25.000
GET       0.527       30.000
GET       0.559       35.000
GET       0.591       40.000
GET       0.639       45.000
GET       0.679       50.000
GET       0.711       52.500
GET       0.751       55.000
GET       0.783       57.500
GET       0.823       60.000
GET       0.871       62.500
GET       0.919       65.000
GET       0.967       67.500
GET       1.015       70.000
GET       1.071       72.500
GET       1.127       75.000
GET       1.159       76.250
GET       1.199       77.500
GET       1.239       78.750
GET       1.279       80.000
GET       1.327       81.250
GET       1.383       82.500
GET       1.447       83.750
GET       1.511       85.000
GET       1.591       86.250
GET       1.679       87.500
GET       1.727       88.125
GET       1.775       88.750
GET       1.831       89.375
GET       1.895       90.000
GET       1.959       90.625
GET       2.023       91.250
GET       2.111       91.875
GET       2.191       92.500
GET       2.287       93.125
GET       2.399       93.750
GET       2.447       94.062
GET       2.527       94.375
GET       2.591       94.688
GET       2.671       95.000
GET       2.767       95.312
GET       2.879       95.625
GET       3.007       95.938
GET       3.167       96.250
GET       3.375       96.562
GET       3.679       96.875
GET       3.903       97.031
GET       4.191       97.188
GET       4.607       97.344
GET       5.215       97.500
GET       6.431       97.656
GET       7.967       97.812
GET       9.087       97.969
GET       9.983       98.125
GET      10.751       98.281
GET      11.455       98.438
GET      11.839       98.516
GET      12.159       98.594
GET      12.543       98.672
GET      12.863       98.750
GET      13.183       98.828
GET      13.567       98.906
GET      13.951       98.984
GET      14.271       99.062
GET      14.655       99.141
GET      15.103       99.219
GET      15.295       99.258
GET      15.551       99.297
GET      15.743       99.336
GET      15.999       99.375
GET      16.255       99.414
GET      16.511       99.453
GET      16.767       99.492
GET      17.151       99.531
GET      17.407       99.570
GET      17.791       99.609
GET      17.919       99.629
GET      18.047       99.648
GET      18.303       99.668
GET      18.431       99.688
GET      18.687       99.707
GET      18.815       99.727
GET      19.071       99.746
GET      19.199       99.766
GET      19.455       99.785
GET      19.711       99.805
GET      19.839       99.814
GET      19.967       99.824
GET      20.095       99.834
GET      20.351       99.844
GET      20.479       99.854
GET      20.735       99.863
GET      20.991       99.873
GET      21.247       99.883
GET      21.503       99.893
GET      21.887       99.902
GET      22.143       99.907
GET      22.271       99.912
GET      22.527       99.917
GET      22.783       99.922
GET      23.039       99.927
GET      23.295       99.932
GET      23.551       99.937
GET      23.807       99.941
GET      24.191       99.946
GET      24.575       99.951
GET      24.831       99.954
GET      25.087       99.956
GET      25.343       99.958
GET      25.471       99.961
GET      25.727       99.963
GET      25.983       99.966
GET      26.239       99.968
GET      26.623       99.971
GET      26.879       99.973
GET      27.263       99.976
GET      27.647       99.977
GET      27.775       99.978
GET      28.031       99.979
GET      28.287       99.980
GET      28.543       99.982
GET      28.927       99.983
GET      29.183       99.984
GET      29.567       99.985
GET      29.951       99.987
GET      30.591       99.988
GET      30.719       99.988
GET      30.975       99.989
GET      31.103       99.990
GET      31.359       99.990
GET      31.615       99.991
GET      31.871       99.991
GET      32.255       99.992
GET      32.511       99.993
GET      33.023       99.993
GET      33.279       99.994
GET      33.535       99.994
GET      33.791       99.995
GET      33.791       99.995
GET      34.047       99.995
GET      34.303       99.995
GET      34.559       99.996
GET      34.815       99.996
GET      35.327       99.996
GET      35.583       99.997
GET      35.839       99.997
GET      36.095       99.997
GET      36.351       99.997
GET      36.351       99.997
GET      36.607       99.998
GET      36.863       99.998
GET      37.119       99.998
GET      37.631       99.998
GET      37.887       99.998
GET      38.143       99.998
GET      38.399       99.998
GET      38.655       99.999
GET      38.911       99.999
GET      38.911       99.999
GET      38.911       99.999
GET      39.167       99.999
GET      39.167       99.999
GET      39.423       99.999
GET      39.423       99.999
GET      39.423       99.999
GET      39.679       99.999
GET      39.679       99.999
GET      39.935       99.999
GET      39.935       99.999
GET      39.935       99.999
GET      40.191       99.999
GET      40.191       99.999
GET      40.703      100.000
GET      40.959      100.000
GET      40.959      100.000
GET      40.959      100.000
[...]
GET      41.215      100.000
GET      41.471      100.000
GET      41.471      100.000
GET      41.727      100.000
GET      41.727      100.000
GET      41.727      100.000
[...]
GET      41.983      100.000
GET      41.983      100.000
GET      41.983      100.000
GET      43.263      100.000
GET      43.263      100.000
GET      43.263      100.000
[...]
GET      43.775      100.000
GET      43.775      100.000
GET      43.775      100.000
[...]
GET      44.799      100.000
GET      44.799      100.000
GET      44.799      100.000
[...]
GET      48.127      100.000
GET      48.127      100.000
GET      48.127      100.000
[...]
GET      51.711      100.000
GET      51.711      100.000
---
WAIT      0.000      100.000